src/Catalogs/ГринАПИ_Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГринАПИ_Контакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательWhatsApp</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_ПользователиWhatsApp</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ГринАПИ_ПараметрыПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГринАПИ_ПараметрыПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательWhatsApp</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_ПользователиWhatsApp</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_Контакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ГринАПИ_Контакты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачатьБеседу(Команда)   
	
	Если Не ПроверитьЗаполнение() Тогда		
		Возврат;	
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Для созданием беседы справочник должен быть записан.");
	КонецЕсли; 	
	
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		ПоказатьПредупреждение(, "Информационная база не зарегистрирована.");
	КонецЕсли; 
		
	ТекстПредупреждения = НачатьБеседуНаСервере(); 
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры                                         

&НаСервере
Функция НачатьБеседуНаСервере() 	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользовательИдентификатор = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();                                           
	
	Наименование         = Объект.Наименование;
	НомерТелефона        = Объект.НомерТелефона;
	КонтактИдентификатор = ГринАПИ_Служебный.ПолучитьПользователяСистемыВзаимодействия(Наименование, НомерТелефона);
	
	КлючОбсуждения       = СтрШаблон("%1 - %2", ТекущийПользовательИдентификатор, КонтактИдентификатор);	
	Обсуждение           = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсуждения);
	Результат            = "Беседа успешно обновлена.";
	
	Если Обсуждение = Неопределено Тогда					
		
		Обсуждение           = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Групповое = Ложь;
		Обсуждение.Ключ      = КлючОбсуждения;
		
		Обсуждение.Участники.Добавить(ТекущийПользовательИдентификатор);
		Обсуждение.Участники.Добавить(КонтактИдентификатор);
		
		Обсуждение.Записать();		
		
		Результат = "Беседа успешно создана.";
		
	КонецЕсли;  	
	
	Объект.КлючОбсуждения       = КлючОбсуждения;
	Объект.КонтактИдентификатор = КонтактИдентификатор;
	
	РегистрыСведений.ГринАПИ_ПараметрыПодключения.ДобавитьЗаписьВРегистрСведений(Объект.Ссылка, КлючОбсуждения, 
		КонтактИдентификатор);
	
	Возврат Результат;	
	
КонецФункции
